IDEA StatiCa Open Model
LoadType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of load impuls
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum LoadType
Public Enumeration LoadType
public enum class LoadType
Members
Member name | Value | Description
LoadForce | 0 |  Force load impuls
LoadMoment | 1 |  Moment load impuls
See Also
Reference
IdeaRS.OpenModel.Loading Namespace